#### Pandas provide two data structures for manipulating data, They are: 

1 Series

2 DataFrame

#### Series  : It a one-dimensional labelled array capable of holding data of any type (integer, string, float, python objects, etc.). The axis labels are collectively called indexes. 
 
 
 Pandas Series is nothing but a **column** in an excel sheet

###### Creating a Series

In the real world, a Pandas Series will be created by loading the datasets from existing storage, storage can be SQL Database, CSV file, an Excel file. 

Pandas Series can be created from 

- lists 
- array

- dictionary


- from a scalar value etc.

In [1]:
import pandas as pd
import numpy as np

In [2]:

ser = pd.Series()     ## Creating empty series
ser

C:\Users\acer\AppData\Local\Temp\ipykernel_16796\73980214.py:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  ser = pd.Series()     ## Creating empty series

Series([], dtype: float64)

In [3]:
# creating series from array
data = np.array(['g', 'e', 'e', 'k', 's'])   
ser1 = pd.Series(data)                      
ser1

0    g
1    e
2    e
3    k
4    s
dtype: object

In [4]:
l=["a","b","c"]  ## from list 
ser1 = pd.Series(l)                      
ser1

0    a
1    b
2    c
dtype: object

In [5]:
l=[["a","b","c"]]  ## from 2d list 
ser1 = pd.Series(l)                      
print(ser1)
print(type(ser1))

0    [a, b, c]
dtype: object
<class 'pandas.core.series.Series'>

In [6]:
l=[["a","b","c"],["aa","bb","cc"]]  ## from 2d list 
ser1 = pd.Series(l)                      
print(ser1)
print(type(ser1))

0       [a, b, c]
1    [aa, bb, cc]
dtype: object
<class 'pandas.core.series.Series'>

In [7]:
# creating series from tuple
ser1data = tuple(range(1,10))   
ser1 = pd.Series(data)  
ser1

0    g
1    e
2    e
3    k
4    s
dtype: object

In [8]:
# creating series from dictionary
d = {"a": 10, "b": 20, "c": 30}
ser = pd.Series(data=d)  ## keys are treated as  index
ser

a    10
b    20
c    30
dtype: int64

In [9]:

ser1 = pd.Series(data=d, index=['x', 'y', 'z']) # gives null values as there is mismatch between indexex of keys and the one which we are providing 
ser1

x   NaN
y   NaN
z   NaN
dtype: float64

In [10]:
   
ser.reset_index()                # resetting the index in case of dictionary it will take default index as its keys
ser

a    10
b    20
c    30
dtype: int64

In [11]:
##Create a Series using Scalar:

##If we take the scalar values, then the index must be provided. The scalar value will be repeated for matching the length of the index.


x = pd.Series(4, index=[0, 1, 2, 3])  
print (x)

0    4
1    4
2    4
3    4
dtype: int64

In [12]:
x.shape

(4,)

###### Accessing data from series with indexes

In [13]:
import pandas as pd  
x = pd.Series([1,2,3,4,5],index = ['a','b','c',"d","e"],)  
x

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [14]:
x ## fetching whole series

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [15]:
x["a"] ## fetch 1

1

In [16]:
x["a":]  ## fetch from 1

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [17]:
x["b":] ## fetch from b

b    2
c    3
d    4
e    5
dtype: int64

In [18]:
x["a":"e":2]  ## fetch a,c and e

a    1
c    3
e    5
dtype: int64

In [19]:
x[["a","b","e"]]   ## specific row

a    1
b    2
e    5
dtype: int64

##### series function :


Pandas Series.std()	Calculate the standard deviation of the given set of numbers, DataFrame, column, and rows.


Pandas Series.to_frame()	Convert the series object to the dataframe.


Pandas Series.value_counts()	Returns a Series that contain counts of unique values.  (counts frequency excludes nan)


Pandas Series.to_numpy()      return numpy array

### converting series to dataframe

In [20]:

s = pd.Series(["a", "b", "c"])
s

0    a
1    b
2    c
dtype: object

### Checking series type

In [21]:
type(s)

pandas.core.series.Series

### checking the type of elments of series

In [22]:
s.dtype

dtype('O')

In [23]:

df=s.to_frame() 
df

   0
0  a
1  b
2  c

In [24]:
type(df)

pandas.core.frame.DataFrame

In [25]:
df.dtypes  ## dtypes is used to check the type of all columns of series

0    object
dtype: object

## counts the frequency using : series.value_counts()

In [26]:

  
a = pd.Series([2.4, 10.8, 10.8, np.nan, 3.4])

In [27]:
a

0     2.4
1    10.8
2    10.8
3     NaN
4     3.4
dtype: float64

In [28]:
a.value_counts()  ## counts the frquency of values excluding null

10.8    2
2.4     1
3.4     1
dtype: int64

### series std,mean,sum

In [29]:
s=pd.Series([1,2,3,3,6])
s.std()

1.8708286933869707

In [30]:
s.mean()

3.0

In [31]:
s.sum()

15

##### Series object attributes

Attributes	      Description


Series.index	Defines the index of the Series.

Series.shape	It returns a tuple of shape of the data.

Series.dtype	It returns the data type of the data.

Series.size	    It returns the size of the data.

Series.empty	It returns True if Series object is empty, otherwise returns false.

Series.hasnans	It returns True if there are any NaN values, otherwise returns false.

Series.nbytes	It returns the number of bytes in the data.

Series.ndim	It returns the number of dimensions in the data.

In [32]:
a=pd.Series([1,2,3,4])
a

0    1
1    2
2    3
3    4
dtype: int64

In [33]:
a.index

RangeIndex(start=0, stop=4, step=1)

In [34]:
a.size

4

In [35]:
a.dtype

dtype('int64')

In [36]:
a.empty

False

In [37]:
a.ndim

1

In [38]:
a.hasnans

False

## create a series from dataframe column

In [39]:
df=pd.DataFrame({"state":["delhi","gujrat","up","goa","mp","sikkim"],"population":[90,80,70,10,34,30],"state_region":["north","west","north","south","south","east"]})
df

    state  population state_region
0   delhi          90        north
1  gujrat          80         west
2      up          70        north
3     goa          10        south
4      mp          34        south
5  sikkim          30         east

In [40]:
k=pd.Series(df["state"])
k
type(k)

pandas.core.series.Series

##### Data Frame :
It is a two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). 

A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas 



DataFrame consists of three principal components, the data, rows, and columns.

###### The main difference between Series and Data Frame is that Series can only contain a single list with a particular index, whereas the DataFrame is a combination of more than one series that can analyze the data.

##### different ways of creating DataFrame :

1 :by loading the datasets from existing storage, storage can be SQL Database, CSV file, an Excel file. 
from python dictionaries

2.from python dictionaries

3.from python list

4.from python array

5.from list of dictionaries

In [41]:
# 1 by loading csv files 
import pandas as pd
df=pd.read_csv("D:\\python_datascience\\data sets\\examples\\ex1.csv")
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [42]:
type(df)  ## checking type

pandas.core.frame.DataFrame

In [43]:
df.shape  ## checking shape

(3, 5)

In [44]:
# from dictionary

data={"country":["india","uk","austria","us"],"GDP":[123,345,678,2134]}  # from dictionary 
df=pd.DataFrame(data)   # by default indexing starts from 0 and keys are the names of the columns
df

   country   GDP
0    india   123
1       uk   345
2  austria   678
3       us  2134

In [45]:
d={"name":["piya","riya","asshi","meera"],"age":['20','30','60','23'],\
   "height":[120.3,152.4,155,162],"gender":["f","f","m","f"]}  ## \ is used to break the lines
df=pd.DataFrame(d)
df

    name age  height gender
0   piya  20   120.3      f
1   riya  30   152.4      f
2  asshi  60   155.0      m
3  meera  23   162.0      f

In [46]:
df.dtypes

name       object
age        object
height    float64
gender     object
dtype: object

## info()

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      object
 2   height  4 non-null      float64
 3   gender  4 non-null      object
dtypes: float64(1), object(3)
memory usage: 256.0+ bytes

here, name and gender and age  are qualitattive data and 1 column is of int type and memory size it takes 256

so convert it into int

## astype()

In [48]:
df["age"]=df["age"].astype(int)  ## since age is in object so convert it into int ( default it convert it into int32) and \
##store it into df["age"] to reflect the chnage in df

In [49]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   age     4 non-null      int32
 2   height  4 non-null      float64
 3   gender  4 non-null      object
dtypes: float64(1), int32(1), object(2)
memory usage: 240.0+ bytes

In [50]:
## how to create null values in df  : we can not leave space as below we have to write np.nan.
d={"name":["piya","riya","asshi","meera",],"age":[20,30,60,23],\
   "height":[120.3,152.4,155,162, ],"gender":["f","f","m","f","m"]}  ## \ is used to break the lines
df=pd.DataFrame(d)
df

ValueError: All arrays must be of the same length

In [51]:
## write np.nan to create null values
d={"name":["piya","riya","asshi","meera",np.nan],"age":['20','30','60','23',np.nan],\
   "height":[120.3,152.4,155,162,145 ],"gender":["f","f","m","f","m"]}  ## \ is used to break the lines
df=pd.DataFrame(d)
df

    name  age  height gender
0   piya   20   120.3      f
1   riya   30   152.4      f
2  asshi   60   155.0      m
3  meera   23   162.0      f
4    NaN  NaN   145.0      m

In [52]:
# 3. from list

l1=[1,2,3,4]
df=pd.DataFrame(l1)
df

   0
0  1
1  2
2  3
3  4

by default indexing starts from 0 and column name starts from 0

In [53]:
type(df)

pandas.core.frame.DataFrame

In [54]:

l2=[[1,2,3,4],[23,56,7,8]]  ## from 2 d list
df1=pd.DataFrame(l2)
df1

    0   1  2  3
0   1   2  3  4
1  23  56  7  8

In [55]:
## create a dataframe with index and column
l2=[[1,2,3,4],[23,56,7,8]]
df1=pd.DataFrame(l2,index=["a","b"],columns=["A","B","C","D"])
df1

    A   B  C  D
a   1   2  3  4
b  23  56  7  8

In [56]:
# 4. from python array
import numpy as np

df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),columns=['a', 'b', 'c']) ## default columns names are 0,1,2 
df2

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

### index name with dictionary

In [57]:

data={"country":["india","uk","austria","us"],"GDP":[123,123,678,2134]}  # from dictionary 
df=pd.DataFrame(data,index=["a","b","c","d"])   # by default indexing starts from 0 and keys are the names of the columns
df

   country   GDP
a    india   123
b       uk   123
c  austria   678
d       us  2134

### create data frame of dates

In [ ]:
date=pd.date_range("1/1/2000",periods=12)  ## date range is a pandas function to generate dates 
date

In [ ]:
x1=pd.DataFrame(date,columns=["dates"]) ## column name = dates
x1

In [ ]:
a=np.arange(12)  ## taking array of 11 elements to add new column to existing data frame
x1["newcol"]=pd.Series(a)
x1

In [ ]:
x1.set_index(x1["dates"],inplace=True) ## making index as dates
x1

In [ ]:
x1.drop(columns=["dates"],inplace=True)  ## drop dates column
x1

In [ ]:
x1.reset_index(inplace=True) ## reset index

In [ ]:
x1

In [ ]:
date=pd.date_range("1/1/2000",periods=12)  ## date range is a pandas function to generate dates 
date

In [ ]:
### create a dataframe having values of date 
x1=pd.DataFrame(date)
x1

In [ ]:
a=np.arange(12) ## take this array of 12 elements to create a new column if we take less value than nan values gets generated
a

In [ ]:
x1["new"]=pd.Series(a) ## adding new column
x1

In [ ]:
x1.set_index(x1[0],inplace=True) ## making date column as index
x1

In [ ]:
x1.drop(columns=[0],inplace=True) ## drop that column

In [ ]:
x1

In [ ]:
x1["newcol1"]=pd.Series(np.arange(12)) ## adding new column

### in above output generates nan values due to mismatch index

In [ ]:
x1

In [ ]:
x1=x1.reset_index() ### change to default index
x1

In [ ]:
x1.drop(columns=["newcol1"],inplace=True) ## now drop column

In [ ]:
x1

### now add the new  column

In [ ]:
x1["newcol"]=pd.Series(list(range(12)))
x1

### now rename the columns index as date

In [ ]:
x1.rename(columns={0: "dates"},inplace=True) ## index (old name) and new_column as new name
x1

In [ ]:
x1.shape

### How to read top rows

In [ ]:
x1.head() ## default top 5 rows

In [ ]:
#x1.head(8)

In [ ]:
## last 5 rows
x1.tail()

### to get specific rows

In [ ]:
x1[3:9] ## slicing

or

In [ ]:
x1.iloc[3:9]    ## iloc used when intregal index is used , loc is used when naming is used as index

##### Dealing with rows :

 basic operations on rows like 
 
 selecting, 
 
 deleting, 
 
 adding 
 
 renaming.

In [58]:
data={"country":["india","uk","austria","us","canada","pakistan"],"GDP":[123,123,678,2134,3456,232],"country_type":["developing","developed","developed","developed","developed","developing"]}  # from dictionary 
df=pd.DataFrame(data)   # by default indexing starts from 0 and keys are the names of the columns
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

#### head() method is used to return top n (5 by default) rows of a data frame or series.

Syntax: Dataframe.head(n=5)

Parameters:
n: integer value, number of rows to be returned

Return type: Dataframe with top n rows

In [59]:
df.head()  ## fetching top 5 rows

   country   GDP country_type
0    india   123   developing
1       uk   123    developed
2  austria   678    developed
3       us  2134    developed
4   canada  3456    developed

In [60]:
df.head(2)

  country  GDP country_type
0   india  123   developing
1      uk  123    developed

In [61]:
df.tail(2)  ## fetching bottom 2 rows

    country   GDP country_type
4    canada  3456    developed
5  pakistan   232   developing

In [62]:
df.tail(4)

    country   GDP country_type
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

###### Row Selection: : fetching rows
Pandas provide a unique method to retrieve rows from a Data frame.DataFrame.loc[] method is used to retrieve rows from Pandas DataFrame. Rows can also be selected by passing integer location to an iloc[] function. indexing,slicing,loc.iloc


###### loc : loc() is label based data selecting method which means that we have to pass the name of the row or column which we want to select. 

This method includes the last element of the range passed in it


###### iloc:  iloc() is a indexed based selecting method which means that we have to pass integer index in the method to select specific row/column. 

selecting particular number of rows and columns : df.iloc: [[2,4],[7,9]] or [:[3,4,6] ]

This method does not include the last element of the range passed

In [63]:
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

In [64]:
df.iloc[3]  ## fetch row 3

country                us
GDP                  2134
country_type    developed
Name: 3, dtype: object

In [65]:
type(df.iloc[3])  ## type : series

pandas.core.series.Series

In [66]:
df.iloc[-1]

country           pakistan
GDP                    232
country_type    developing
Name: 5, dtype: object

In [67]:
df.iloc[0:3]   ### start = 0 and 3 means end (taking end -1)

   country  GDP country_type
0    india  123   developing
1       uk  123    developed
2  austria  678    developed

In [68]:
df.iloc[::-1]   ##fetching from end

    country   GDP country_type
5  pakistan   232   developing
4    canada  3456    developed
3        us  2134    developed
2   austria   678    developed
1        uk   123    developed
0     india   123   developing

In [69]:
df[0:7:2]  ## fetch 0,2,4,6

   country   GDP country_type
0    india   123   developing
2  austria   678    developed
4   canada  3456    developed

In [70]:
df.iloc[[1,3]]  ### selecting particular rows

  country   GDP country_type
1      uk   123    developed
3      us  2134    developed

In [71]:
df.iloc[1:4,1:3] ## selecting sepcific rows and columns

    GDP country_type
1   123    developed
2   678    developed
3  2134    developed

In [72]:
df.iloc[:,1]  ## FECTHING ROWS ALL WITH SPECIFIC COLUMN

0     123
1     123
2     678
3    2134
4    3456
5     232
Name: GDP, dtype: int64

In [73]:
### Selecting particular rows and  columns
df.iloc[[1,4,5],[0,2]]  ## fetching rows 1,4,5 and column 0 and 2

    country country_type
1        uk    developed
4    canada    developed
5  pakistan   developing

In [74]:
### Selecting particular rows and  columns
df.iloc[[1,3],[1,2]]

    GDP country_type
1   123    developed
3  2134    developed

In [75]:
df.iloc[:,2]

0    developing
1     developed
2     developed
3     developed
4     developed
5    developing
Name: country_type, dtype: object

### accessing with name

In [77]:
df.iloc[:,"country_type"]

ValueError: Location based indexing can only have [integer, integer slice (START point is INCLUDED, END point is EXCLUDED), listlike of integers, boolean array] types

## making country as index

In [78]:
df.set_index(df["country"],inplace=True)

In [79]:
df

           country   GDP country_type
country
india        india   123   developing
uk              uk   123    developed
austria    austria   678    developed
us              us  2134    developed
canada      canada  3456    developed
pakistan  pakistan   232   developing

In [80]:
df.drop(columns=["country"],inplace=True)

In [81]:
df

           GDP country_type
country
india      123   developing
uk         123    developed
austria    678    developed
us        2134    developed
canada    3456    developed
pakistan   232   developing

In [83]:
df.iloc[0] ## featching first row

GDP                    123
country_type    developing
Name: india, dtype: object

## loc is used to select based on 

- A string

- A list of strings

In [84]:
df.iloc[0]

GDP                    123
country_type    developing
Name: india, dtype: object

In [85]:
df.loc["india"] ## fetching first row with index name

GDP                    123
country_type    developing
Name: india, dtype: object

### Note 



loc - Slice notation using strings as the start and stop values

iloc- does not include last element

In [86]:
df.loc[0:4] ## not be able to select based on  integer index  wen loc is used

TypeError: cannot do slice indexing on Index with these indexers [0] of type int

In [87]:
df.loc[:,"GDP"] ## all rows with specific column gdp

country
india        123
uk           123
austria      678
us          2134
canada      3456
pakistan     232
Name: GDP, dtype: int64

In [88]:
df.iloc[:,1]  ## EXTRACTING ALL ROWS WITH GDP SO USE 1 AS COLUMN INDEX OF GDP  ---- df.iloc[:,"GDP"]  gives error

country
india       developing
uk           developed
austria      developed
us           developed
canada       developed
pakistan    developing
Name: country_type, dtype: object

In [89]:
df.loc["india":"canada",:]  ## india to canada(including) with all columns

          GDP country_type
country
india     123   developing
uk        123    developed
austria   678    developed
us       2134    developed
canada   3456    developed

In [90]:
df.iloc[0:4,:]  ## here it excludes last element ie canada

          GDP country_type
country
india     123   developing
uk        123    developed
austria   678    developed
us       2134    developed

In [91]:
df.loc[["india","canada","pakistan"],["country_type"]]  ## specific rows and column

         country_type
country
india      developing
canada      developed
pakistan   developing

### Resetting the index

In [92]:
df.reset_index(inplace=True)
df

    country   GDP country_type
0     india   123   developing
1        uk   123    developed
2   austria   678    developed
3        us  2134    developed
4    canada  3456    developed
5  pakistan   232   developing

### loop in  particular  data set

## loop in particular column

In [93]:
for i in df["GDP"]:
    print(i)

123
123
678
2134
3456
232

In [94]:
l=[]
for i in df["GDP"]:
    l.append(np.log(i))
print(l)

[4.812184355372417, 4.812184355372417, 6.519147287940395, 7.665753431861699, 8.147867129923947, 5.44673737166631]

In [95]:
df["log_gdp"]=pd.Series(l)  ## creation od series 
df["log_gdp"]

0    4.812184
1    4.812184
2    6.519147
3    7.665753
4    8.147867
5    5.446737
Name: log_gdp, dtype: float64

In [96]:
k=pd.Series(l)
k

0    4.812184
1    4.812184
2    6.519147
3    7.665753
4    8.147867
5    5.446737
dtype: float64

In [98]:
df["log_gdp"]=k  ## adding column to df
df

    country   GDP country_type   log_gdp
0     india   123   developing  4.812184
1        uk   123    developed  4.812184
2   austria   678    developed  6.519147
3        us  2134    developed  7.665753
4    canada  3456    developed  8.147867
5  pakistan   232   developing  5.446737

### Create series using dataframe column

In [99]:

s=pd.Series(df["country"])
s

0       india
1          uk
2     austria
3          us
4      canada
5    pakistan
Name: country, dtype: object

#### Dataframe

In [100]:
df=pd.DataFrame({"state":["delhi","gujrat","up","goa","mp","sikkim"],"population":[90,80,70,10,34,30],"state_region":["north","west","north","south","south","east"]})
df

    state  population state_region
0   delhi          90        north
1  gujrat          80         west
2      up          70        north
3     goa          10        south
4      mp          34        south
5  sikkim          30         east

In [103]:
df[1]  ## treating  1 as colum thats why  error

KeyError: 1

In [104]:
df[1:] ## or df.iloc[1:]

    state  population state_region
1  gujrat          80         west
2      up          70        north
3     goa          10        south
4      mp          34        south
5  sikkim          30         east

In [105]:

df=pd.read_csv("D:\\python_datascience\\data sets\\examples\\csv_mindex.csv")
df

  key1 key2  value1  value2
0  one    a       1       2
1  one    b       3       4
2  one    c       5       6
3  one    d       7       8
4  two    a       9      10
5  two    b      11      12
6  two    c      13      14
7  two    d      15      16

In [106]:
df1=pd.read_csv("D:\\python_datascience\\data sets\\examples\\csv_mindex.csv",index_col=["key1"])  # creating key1 as index at the time of creation 
df1

     key2  value1  value2
key1
one     a       1       2
one     b       3       4
one     c       5       6
one     d       7       8
two     a       9      10
two     b      11      12
two     c      13      14
two     d      15      16

### to fetch specific data from data frame : slicing

In [107]:

df1[2:6]   # fetching rows from 2 to 5

     key2  value1  value2
key1
one     c       5       6
one     d       7       8
two     a       9      10
two     b      11      12

In [108]:
df1[3:]              # from row 3rd to last   same as df1.iloc[3:]

     key2  value1  value2
key1
one     d       7       8
two     a       9      10
two     b      11      12
two     c      13      14
two     d      15      16

#### addition of new rows 



 adding new rows to the DataFrame using append function. It adds the new rows at the end
 
 
 #####  various method::
append()

concat()

iloc[]

loc[]

## using append()  - add the rows of one data frame to the target dataframe at the end
Parameters

dictionary or Pandas Series or Dataframe  Object with values for new row


ignore_index = True Means the index from the series or the source dataframe will be ignored. The index available in the target dataframe will be used, instead. False means otherwise. This is optional. Returns


A resultant dataframe which has the rows from the target dataframe and a new row appended.

In [109]:
 

d = pd.DataFrame([[7, 8], [9, 10]], columns = ['x','y'])  
d2 = pd.DataFrame([[11, 12]],columns = ['1','2'])

In [110]:
d2

    1   2
0  11  12

In [111]:
d

   x   y
0  7   8
1  9  10

In [112]:
d = d.append(d2)  
print (d)

     x     y     1     2
0  7.0   8.0   NaN   NaN
1  9.0  10.0   NaN   NaN
0  NaN   NaN  11.0  12.0

C:\Users\acer\AppData\Local\Temp\ipykernel_16796\3412848028.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d = d.append(d2)

In [114]:
d = pd.DataFrame([[7, 8], [9, 10]], columns = ['x','y'])  
d2 = pd.DataFrame([[11, 12]],columns = ['1','2'])

In [115]:
d = d.append(d2,ignore_index=True)  
print (d)

     x     y     1     2
0  7.0   8.0   NaN   NaN
1  9.0  10.0   NaN   NaN
2  NaN   NaN  11.0  12.0

C:\Users\acer\AppData\Local\Temp\ipykernel_16796\1955943298.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d = d.append(d2,ignore_index=True)

In [116]:
 
d = pd.DataFrame([[7, 8], [9, 10]], columns = ['x','y'])  
d2 = pd.DataFrame([[11, 12],[2,3]],columns=["x","y"])  
d1 = d.append(d2)  
d1

C:\Users\acer\AppData\Local\Temp\ipykernel_16796\235438825.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d1 = d.append(d2)

    x   y
0   7   8
1   9  10
0  11  12
1   2   3

In [117]:
d

   x   y
0  7   8
1  9  10

In [118]:
d2

    x   y
0  11  12
1   2   3

In [119]:
 
d = pd.DataFrame([[7, 8], [9, 10]], columns = ['x','y'],index=["a","b"])  
d2 = pd.DataFrame([[11, 12],[2,3]],columns=["x","y"])

In [120]:
d

   x   y
a  7   8
b  9  10

In [121]:
d2

    x   y
0  11  12
1   2   3

In [122]:
d1 = d2.append(d,ignore_index=True)  
d1

C:\Users\acer\AppData\Local\Temp\ipykernel_16796\2293091536.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  d1 = d2.append(d,ignore_index=True)

    x   y
0  11  12
1   2   3
2   7   8
3   9  10

In [123]:

  
dict = {'Name':['Martha', 'Tim', 'Rob', 'Georgia'],
        'Maths':[87, 91, 97, 95],
        'Science':[83, 99, 84, 76]
       }
  
df = pd.DataFrame(dict,index=["x","y","z","a"])
  
display(df)
  
df2 = {'Name': 'Amy', 'Maths': 89, 'Science': 93}
df = df.append(df2, ignore_index = True)
  
display(df)

      Name  Maths  Science
x   Martha     87       83
y      Tim     91       99
z      Rob     97       84
a  Georgia     95       76

C:\Users\acer\AppData\Local\Temp\ipykernel_16796\3779637667.py:11: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df = df.append(df2, ignore_index = True)

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76
4      Amy     89       93

append function will add rows of second data frame to first dataframe iteratively one by one. Concat function will do a single operation to finish the job, which makes it faster than append().

### using concat

In [ ]:
import pandas as pd
import numpy as np
  
d1 = {'Name':['Martha', 'Tim', 'Rob', 'Georgia'],
        'Maths':[87, 91, 97, 95],
        'Science':[83, 99, 84, 76]
       }
d2 = {'Name': 'Amy', 'Maths': 89, 'Science': 93}
d3 = {'Name': 'Abc', 'Maths': 80, 'Science': 95}
  
df1 = pd.DataFrame(d1) 
print(df1)
df2 = pd.DataFrame(d2,index=[0]) 
print(df2)
df3 = pd.DataFrame(d3,index=[0])  
print(df3)

df = pd.concat([df1,df2,df3], ignore_index = True, axis = 0)  # adding the rows of df1+df2+df3
df

##### Using ILOC
You can use the iLoc[] attribute to add a row at a specific position in the dataframe. 

iloc is an integer-based indexing for selecting rows from the dataframe. You can also use it to assign new rows at that position.

Adding a row at a specific index position will replace the existing row at that position.

In [124]:
df

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  Georgia     95       76
4      Amy     89       93

In [125]:
#adding row 1 at position 3
df.iloc[3]=["balmeet",90,65]   # the existing 3rd row has been replaced by new one
df

      Name  Maths  Science
0   Martha     87       83
1      Tim     91       99
2      Rob     97       84
3  balmeet     90       65
4      Amy     89       93

In [127]:
df.iloc[1:3]=[["abc",90,90],["bac",100,100]]
df

      Name  Maths  Science
0   Martha     87       83
1      abc     90       90
2      bac    100      100
3  balmeet     90       65
4      Amy     89       93

In [ ]:
#adding row at the position which does not exisit in this dataframe raise an error i.e iloc doesnt not expand the size of df
r=len(df.index)  # gives new length of the rows 
print(r)
df.iloc[r]=["x",90,65]  
df

##### Using LOC
You can add a row to the dataframe using the loc parameter. loc[] is used to access a set of rows from the dataframe using the index label. You can also assign rows with a specific index label using the loc attribute.

When using the loc[] attribute, its not mandatory that a row already exists with a specific label. Itll automatically extend the dataframe and add a row with that label, unlike the iloc[] method.

In [ ]:
df

In [ ]:
df.loc[4]=["u",67,89]  #it also replace the existing one as iloc does
df

In [ ]:
df.loc[6]=["sanjot",98,90]  # it may add the new row if that index label is not exist unlike iloc it may enalrge the size of df
df

In [ ]:
df.iloc[2:4]=(["meet",90,12],["garima",90,12])  # adding rows at specific rows numbers 
df

##### Row Deletion

We can delete or drop any rows from a DataFrame using the index label. 


If in case, the label is duplicate then multiple rows will be deleted.

In [128]:
###Deletion of rows:



  
df1 = pd.DataFrame([[4, 5], [6, 7]], columns = ['x','y'])  
df2 = pd.DataFrame([[8, 9], [10, 11]], columns = ['x','y'])  
 
df1 = df1.append(df2) 
df1

C:\Users\acer\AppData\Local\Temp\ipykernel_16796\3198036199.py:9: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  df1 = df1.append(df2)

    x   y
0   4   5
1   6   7
0   8   9
1  10  11

In [129]:
df1 = df1.drop(0)    #
print("row with index number 0 has been deleted\n\n",df1)

row with index number 0 has been deleted

     x   y
1   6   7
1  10  11

In [130]:
df1=df1.reset_index()
df1

   index   x   y
0      1   6   7
1      1  10  11

In [131]:

df1.drop(columns=["index"],inplace=True)
df1

    x   y
0   6   7
1  10  11

In [132]:
df=pd.DataFrame({"state":["delhi","gujrat","up","goa","mp","sikkim"],"population":[90,80,70,10,34,30],"state_region":["north","west","north","south","south","east"]})
df

    state  population state_region
0   delhi          90        north
1  gujrat          80         west
2      up          70        north
3     goa          10        south
4      mp          34        south
5  sikkim          30         east

In [138]:
df.drop(0,inplace=True)

KeyError: '[0] not found in axis'

In [134]:
df

    state  population state_region
1  gujrat          80         west
2      up          70        north
3     goa          10        south
4      mp          34        south
5  sikkim          30         east

In [140]:
df.drop(index=df.index[1:6:2])  ## delete every alternate rows

    state  population state_region
1  gujrat          80         west
3     goa          10        south
5  sikkim          30         east

In [ ]:
df.drop(index=[1,4],inplace=True)  ## deleting specific rows

In [ ]:
df

In [ ]:
df=pd.DataFrame({"state":["delhi","gujrat","up","goa","mp","sikkim"],"population":[90,80,70,10,34,30],"state_region":["north","west","north","south","south","east"]})
df

In [ ]:
df.drop(index=df.index[0:6:2],inplace=True) ## deleting rows with gap of 2

In [ ]:
df

#### columns

- column selection

- column dropping

- column renaming

- column addition

- column ordering

In [143]:
dict = {'Name':['Martha', 'Tim', 'Rob', 'Georgia'],
        'Maths':[87, 91, 97, 95],
        'Science':[83, 99, 84, 76]
       }
  
df = pd.DataFrame(dict,index=["x","y","z","a"])
  
df

      Name  Maths  Science
x   Martha     87       83
y      Tim     91       99
z      Rob     97       84
a  Georgia     95       76

In [144]:
df["Name"]  ## fetching single column

x     Martha
y        Tim
z        Rob
a    Georgia
Name: Name, dtype: object

In [145]:
type(df["Name"])  ## checking type

pandas.core.series.Series

In [146]:
type(df[["Name"]]) ## checking type

pandas.core.frame.DataFrame

In [147]:
df[["Name","Maths"]] ## fetching multiple columns

      Name  Maths
x   Martha     87
y      Tim     91
z      Rob     97
a  Georgia     95

## Column renaming

In [148]:
df.rename(columns = {'Name':"student_name", 'Maths':'Main subject'}, inplace = True)
df

  student_name  Main subject  Science
x       Martha            87       83
y          Tim            91       99
z          Rob            97       84
a      Georgia            95       76

## Column addition

In [149]:
df["Grade"]=pd.Series(["a","b","a","b"])
df

# #df["Grade"]=pd.Series(["a","b","a","b"],index=["x","y","z","a"])
#df

  student_name  Main subject  Science Grade
x       Martha            87       83   NaN
y          Tim            91       99   NaN
z          Rob            97       84   NaN
a      Georgia            95       76   NaN

In [150]:
## why we get nan due to mismatch index

In [151]:
df.reset_index(inplace=True)
df

  index student_name  Main subject  Science Grade
0     x       Martha            87       83   NaN
1     y          Tim            91       99   NaN
2     z          Rob            97       84   NaN
3     a      Georgia            95       76   NaN

In [152]:
df.drop(columns=["index","Grade"],inplace=True)
df

  student_name  Main subject  Science
0       Martha            87       83
1          Tim            91       99
2          Rob            97       84
3      Georgia            95       76

In [153]:
df["grade"]=pd.Series(["a","b","a","b"])
df

  student_name  Main subject  Science grade
0       Martha            87       83     a
1          Tim            91       99     b
2          Rob            97       84     a
3      Georgia            95       76     b

### Columns re-order

In [154]:
df = df[['student_name', "grade","Main subject","Science"]]
df

  student_name grade  Main subject  Science
0       Martha     a            87       83
1          Tim     b            91       99
2          Rob     a            97       84
3      Georgia     b            95       76

### extracting columns names

In [ ]:
df.columns

### extracting column types

In [ ]:
df.dtypes

### extarcting object dtypes columns

In [155]:
df.select_dtypes(include="object")

  student_name grade
0       Martha     a
1          Tim     b
2          Rob     a
3      Georgia     b

### extarcting columns  names of object types

In [156]:
k=df.select_dtypes(include="object").columns
k

Index(['student_name', 'grade'], dtype='object')

In [ ]:
for i in k:
    print(k)

### Column drop

In [ ]:
df.drop(columns=["Main subject"],inplace=True)
df

In [ ]:
df.drop(columns=["grade","Science"],inplace= True)
df

Or

In [ ]:
df.drop(['Grade', 'Science'], axis=1,inplace=True)

In [ ]:
df

## adding categorical data column

In [ ]:
import numpy as np

df=pd.DataFrame({"A":[1,2,np.nan],"B":[5,np.nan,np.nan],"c":[1,2,3]})  #np.nan is used to add missing values 
df["cat_col"]=pd.Series("A B C".split())
df

#### wap to create dataframe from dictionary and add new columns to it

In [157]:
import pandas as pd
import numpy as np
data={"country":["india","uk","austria","us"],"GDP":[123,345,678,2134]}  # from dictionary 
df=pd.DataFrame(data)
print(df)
l=[]
##l1=[]
for i in df["GDP"]:
    square=i*i
    l.append(square)
    #l1.append(round(np.log(i),2)
df["gdp_square"]=pd.Series(l)
df

   country   GDP
0    india   123
1       uk   345
2  austria   678
3       us  2134

   country   GDP  gdp_square
0    india   123       15129
1       uk   345      119025
2  austria   678      459684
3       us  2134     4553956